Revit 2024 API
StructuralSectionAnalysisParams.PlasticModulusWeakAxis Property
 Plastic section modulus in bending about main weak axis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double PlasticModulusWeakAxis { get; set; }
Visual Basic
Public Property PlasticModulusWeakAxis As Double
	Get
	Set
Visual C++
public:
property double PlasticModulusWeakAxis {
	double get ();
	void set (double value);
}
See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace